(ns newsrecommend.data.city)

(def city-map {"河北" 0
               "山西" 1
               "辽宁" 2
               "吉林" 3
               "黑龙江" 4
               "江苏" 5 
               "浙江" 6
               "安徽" 7
               "福建" 8
               "江西" 9
               "山东" 10
               "河南" 11
               "湖北" 12
               "湖南" 13 
               "广东" 14
               "海南" 15
               "四川" 16
               "贵州" 17
               "云南" 18
               "陕西" 19
               "甘肃" 20
               "青海" 21
               "台湾" 22
               "北京" 23
               "天津" 24
               "上海" 25
               "重庆" 26
               "广西" 27
               "内蒙古" 28
               "西藏" 29
               "宁夏" 30
               "新疆" 31
               "香港" 32
               "澳门" 33}
  )
